app/controllers/entries_controller.rb

SELECT * FROM "entries" ORDER BY created_at DESC LIMIT 7 OFFSET 0
SELECT count(*) AS count_all FROM "entries"
---
  def index
    @entries = Entry.paginate :page => @page, :per_page => @per_page, :order => 'created_at DESC'

SELECT * FROM "entries" WHERE ("entries"."id" = 1)
---
  def show
    @entry = Entry.find(params[:id])

SELECT * FROM "entries" WHERE ("entries"."id" = 953125641)
---
  def edit
    @entry = Entry.find(params[:id])

INSERT INTO "entries" ("status", "updated_at", "title", "finished_at", "note", "due_at", "user_id", "scheduled_at", "created_at") VALUES('inbox', '2009-01-18 13:15:48', 'hello this is in inbox', NULL, '', '2009-01-18 13:14:00', NULL, NULL, '2009-01-18 13:15:48')
---
  def create
    @entry = Entry.new(params[:entry])
    #@entry.user = current_user

    respond_to do |format|
      if @entry.save

SELECT * FROM "entries" WHERE ("entries"."id" = 953125641)
---
  def update
    @entry = Entry.find(params[:id])

SELECT * FROM "entries" WHERE ("entries"."id" = 953125641)
DELETE FROM "entries" WHERE "id" = 953125641
---
  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy